
// Закомментируйте ненужные строки так, чтобы в выводе получилось:
// "// - Это комментарий) Это не сложно".

public class TaskNumber2{
    public static void main(String[] args){
//        System.out.println("#  - Это комментарий) Стоп, это не тот язык");
          System.out.println("// - Это комментарий) Это не сложно");
//        System.out.println("// - Это не комментарий) Это не сложно");
//        System.out.println("// - Это комментарий) Это сложно");
//        System.out.println("// - Это не комментарий) Это не сложно");
//        System.out.println("можно даже попробовать многострочный комментарий");
    }
}
