
// Напишите программу, которая выведет на экран "Hello Programming!" (без кавычек)
// на 2 строках, по слову на каждой.

// Sample Input:
// Sample Output:
//      Hello
//      Programming!

public class TaskNumber3 {
    public static void main(String[] args) {
        System.out.println("Hello");
        System.out.println("Programming!");
    }
}
