
//Напишите программу, которая выводит на экран строку  "Hello world!".

public class TaskNumber1 {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}