
// Напишите программу, которая выводит на экран строку  "Hello world!".
//
// Sample Input:
// Sample Output:
//      Hello world!

public class TaskNumber1 {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}