
// Напишите программу, которая выводит на экран строку "Hello, Java!" (без кавычек)
//
// Sample Input:
//
// Sample Output:
//      Hello, Java!

import java.util.Scanner;

public class TaskNumber5 {
    public static void main(String[] args) {
        System.out.println("Hello, Java!");
    }
}
